# 4. Pemilihan kolom (columns selection) pada `DataFrame` berdasarkan tipe data

In [5]:
# Import all of the necessary packages
import pandas as pd
import numpy as np

## Persiapan `DataFrame`

In [7]:
n_rows = 5
n_cols = 2
cols = ["bil_pecahan", "bil_bulat"]

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df = df.astype({"bil_bulat": "float32"})
df["teks"] = list("ABCDE")
dt = pd.date_range("2020-01-01", periods=n_rows, freq="h")
df["waktu"] = pd.to_datetime(dt, format="%d%b%Y:%H:%M:%S.%f")
df

   bil_pecahan  bil_bulat teks               waktu
0           15       17.0    A 2020-01-01 00:00:00
1           11       18.0    B 2020-01-01 01:00:00
2            8       12.0    C 2020-01-01 02:00:00
3           16       18.0    D 2020-01-01 03:00:00
4           19        9.0    E 2020-01-01 04:00:00

In [8]:
df.dtypes

bil_pecahan             int32
bil_bulat             float32
teks                   object
waktu          datetime64[ns]
dtype: object

## Memilih kolom bertipe data numerik

In [10]:
df.select_dtypes?

Signature: df.select_dtypes(include=None, exclude=None) -> 'Self'
Docstring:
Return a subset of the DataFrame's columns based on the column dtypes.

Parameters
----------
include, exclude : scalar or list-like
    A selection of dtypes or strings to be included/excluded. At least
    one of these parameters must be supplied.

Returns
-------
DataFrame
    The subset of the frame including the dtypes in ``include`` and
    excluding the dtypes in ``exclude``.

Raises
------
ValueError
    * If both of ``include`` and ``exclude`` are empty
    * If ``include`` and ``exclude`` have overlapping elements
    * If any kind of string dtype is passed in.

See Also
--------
DataFrame.dtypes: Return Series with the data type of each column.

Notes
-----
* To select all *numeric* types, use ``np.number`` or ``'number'``
* To select strings you must use the ``object`` dtype, but note that
  this will return *all* object dtype columns
* See the `numpy dtype hierarchy
  <https://numpy.org/doc/stable/reference/arrays.scalars.html>`__
* To select datetimes, use ``np.datetime64``, ``'datetime'`` or
  ``'datetime64'``
* To select timedeltas, use ``np.timedelta64``, ``'timedelta'`` or
  ``'timedelta64'``
* To select Pandas categorical dtypes, use ``'category'``
* To select Pandas datetimetz dtypes, use ``'datetimetz'``
  or ``'datetime64[ns, tz]'``

Examples
--------
>>> df = pd.DataFrame({'a': [1, 2] * 3,
...                    'b': [True, False] * 3,
...                    'c': [1.0, 2.0] * 3})
>>> df
        a      b  c
0       1   True  1.0
1       2  False  2.0
2       1   True  1.0
3       2  False  2.0
4       1   True  1.0
5       2  False  2.0

>>> df.select_dtypes(include='bool')
   b
0  True
1  False
2  True
3  False
4  True
5  False

>>> df.select_dtypes(include=['float64'])
   c
0  1.0
1  2.0
2  1.0
3  2.0
4  1.0
5  2.0

>>> df.select_dtypes(exclude=['int64'])
       b    c
0   True  1.0
1  False  2.0
2   True  1.0
3  False  2.0
4   True  1.0
5  False  2.0
File:      c:\users\alima\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method

In [11]:
df.select_dtypes(include="number")

   bil_pecahan  bil_bulat
0           15       17.0
1           11       18.0
2            8       12.0
3           16       18.0
4           19        9.0

In [12]:
df.select_dtypes(include="float32")

   bil_bulat
0       17.0
1       18.0
2       12.0
3       18.0
4        9.0

In [13]:
df.select_dtypes(include="int32")

   bil_pecahan
0           15
1           11
2            8
3           16
4           19

## Memilih kolom bertipe data datetime

In [15]:
df.select_dtypes(include="datetime")

                waktu
0 2020-01-01 00:00:00
1 2020-01-01 01:00:00
2 2020-01-01 02:00:00
3 2020-01-01 03:00:00
4 2020-01-01 04:00:00

## Memilih kolom bertipe data object

In [17]:
df.select_dtypes(include="object")

  teks
0    A
1    B
2    C
3    D
4    E